# PANDAS

## DATAFRAME
    dataframe is used for representing tabular data such as excel file

In [1]:
import pandas as pd
import numpy as np

In [2]:
weather={
    'date':['1/2/18','2/2/18','3/2/18'],
    'codition':['hot','cold','rain']
}

In [3]:
df=pd.DataFrame(weather)

In [4]:
# pd.DataFrame(data=weather,columns=[["name","rollno"]])

In [5]:
df

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [6]:
df.shape

(3, 2)

In [7]:
row,column=df.shape

In [8]:
row

3

In [9]:
column

2

df.head() function is used when we need some data from lakh of data

In [10]:
df.head() #output frst five rows

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [11]:
df.head(10)  #output first 10 rows

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [12]:
df.tail(1) # output from last

     date codition
2  3/2/18     rain

In [13]:
df.columns

Index(['date', 'codition'], dtype='object')

In [14]:
df[:]

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [15]:
df[0:2]

     date codition
0  1/2/18      hot
1  2/2/18     cold

In [16]:
df[:]

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [17]:
df.codition #or fd[["condition"]]

0     hot
1    cold
2    rain
Name: codition, dtype: object

In [18]:
df[["codition"]]

  codition
0      hot
1     cold
2     rain

In [19]:
df[["date",'codition']]

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [20]:
df["date"].max()

'3/2/18'

In [21]:
df["date"].min()

'1/2/18'

In [22]:
df.describe()

          date codition
count        3        3
unique       3        3
top     2/2/18     cold
freq         1        1

In [23]:
df[df.date>"2/2/18"]

     date codition
2  3/2/18     rain

In [24]:
df.set_index('date',inplace=True) #set the index

In [25]:
df

       codition
date
1/2/18      hot
2/2/18     cold
3/2/18     rain

In [26]:
df.loc['2/2/18']

codition    cold
Name: 2/2/18, dtype: object

In [27]:
df.reset_index(inplace=True)

In [28]:
df

     date codition
0  1/2/18      hot
1  2/2/18     cold
2  3/2/18     rain

In [29]:
x_data=np.linspace(1,100,100000)
y_data=(0.5 * x_data)+5

In [30]:
x_data

array([  1.        ,   1.00099001,   1.00198002, ...,  99.99801998,
        99.99900999, 100.        ])

In [31]:
y_data

array([ 5.5       ,  5.500495  ,  5.50099001, ..., 54.99900999,
       54.999505  , 55.        ])

In [32]:
x_data=pd.DataFrame(data=x_data,columns=[["X_data"]])
x_data.head()

    X_data
0  1.00000
1  1.00099
2  1.00198
3  1.00297
4  1.00396

In [33]:
y_data=pd.DataFrame(data=y_data,columns=[["Y_data"]])
y_data.head()

     Y_data
0  5.500000
1  5.500495
2  5.500990
3  5.501485
4  5.501980

In [34]:
my_data=pd.concat([x_data,y_data],axis=1)

In [35]:
my_data.head(10)

    X_data    Y_data
0  1.00000  5.500000
1  1.00099  5.500495
2  1.00198  5.500990
3  1.00297  5.501485
4  1.00396  5.501980
5  1.00495  5.502475
6  1.00594  5.502970
7  1.00693  5.503465
8  1.00792  5.503960
9  1.00891  5.504455

In [36]:
df=pd.read_csv("Data.csv")

# since there are missing value in the form of NaN so what can we do for it

In [37]:
df.isnull().sum()   # df.isnull().tail() produce the number of nan value in corresponding column

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [38]:
df[df.Age.isnull()]

  Country  Age   Salary Purchased
6   Spain  NaN  52000.0        No

In [39]:
df.dropna(axis=0,how='any').shape   # axis 0 means drop the row having Nan value

(8, 4)

In [40]:
df.dropna(axis=0,subset=['Age','Salary'],how='all').shape   # no one drop because not all the value in a single row have nana vaue

(10, 4)

In [41]:
df["Age"].value_counts(dropna=False)     # if we remove dropna it will drop the NaN value from the output

 37.0    1
 50.0    1
 48.0    1
NaN      1
 35.0    1
 40.0    1
 38.0    1
 30.0    1
 27.0    1
 44.0    1
Name: Age, dtype: int64

In [42]:
df['Country'].value_counts()

France     4
Germany    3
Spain      3
Name: Country, dtype: int64

In [43]:
df.fillna(value='37')

   Country Age Salary Purchased
0   France  44  72000        No
1    Spain  27  48000       Yes
2  Germany  30  54000        No
3    Spain  38  61000        No
4  Germany  40     37       Yes
5   France  35  58000       Yes
6    Spain  37  52000        No
7   France  48  79000       Yes
8  Germany  50  83000        No
9   France  37  67000       Yes